In [1]:
import pandas as pd

data = {
'Coffee_Shop_Name': ['HollyBrew', 'Diego Drip', 'NY Espresso', 'Holly Beans', 'Diego Morning', 'NY Caffeine', 'Diego Delight'],
'Location': ['Hollywood', 'San Diego', 'New York', 'Hollywood', 'San Diego', 'New York', 'San Diego'],
'Rating_out_of_5': [4.5, 4.1, 4.0, 4.7, 4.3, 4.4, 4.2],
'Visitors_per_day': [320, 290, 500, 330, 280, 520, 270]
}

coffee_shops_df = pd.DataFrame(data)
coffee_shops_df

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
1       Diego Drip  San Diego              4.1               290
2      NY Espresso   New York              4.0               500
3      Holly Beans  Hollywood              4.7               330
4    Diego Morning  San Diego              4.3               280
5      NY Caffeine   New York              4.4               520
6    Diego Delight  San Diego              4.2               270

In [ ]:
# Get the details of the first coffee shop in the DataFrame.
# Retrieve the names and ratings of the first three coffee shops.
# Extract the ratings for the last two coffee shops.
# Update the 'Visitors_per_day' for the third coffee shop to 505 using iloc.
# Fetch the details for coffee shops at even indices.
# Extract the names of the last three coffee shops in the DataFrame.

In [4]:
coffee_shops_df.iloc[0]

Coffee_Shop_Name    HollyBrew
Location            Hollywood
Rating_out_of_5           4.5
Visitors_per_day          320
Name: 0, dtype: object

In [9]:
coffee_shops_df.iloc[[0,1,2],[0,2]]

  Coffee_Shop_Name  Rating_out_of_5
0        HollyBrew              4.5
1       Diego Drip              4.1
2      NY Espresso              4.0

In [10]:
coffee_shops_df.iloc[[4,5], [2]]

   Rating_out_of_5
4              4.3
5              4.4

In [11]:
coffee_shops_df.iloc[[0,2,4,6]]

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
2      NY Espresso   New York              4.0               500
4    Diego Morning  San Diego              4.3               280
6    Diego Delight  San Diego              4.2               270

In [12]:
coffee_shops_df.iloc[[3,4,5],[0]]

  Coffee_Shop_Name
3      Holly Beans
4    Diego Morning
5      NY Caffeine